import 'package:islamic/data/model/azker.dart';

class MyAzker {
  static Map<String, Azker> mapazker = Map<String, Azker>();
  static List<Azker> listazker = <Azker>[];
  static Azker azker = Azker(
    category: '',
    count: '',
    description: '',
    reference: '',
    content: '',
  );
  static Future<List<Azker>> getAlldata() async {
    listazker.clear();
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "1",
        description: "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ",
        reference:
            "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.",
        content:
            "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ"));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم",
        reference:
            "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). ",
        content:
            "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم",
        reference: "",
        content:
            "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم",
        reference: "",
        content:
            "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "1",
        description: "",
        reference: "",
        content:
            "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "",
        reference: "",
        content:
            "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "4",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "7",
        description: "",
        reference: "",
        content:
            "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. "));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "",
        reference: "",
        content:
            "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "",
        reference: "",
        content:
            "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "",
        reference: "",
        content:
            "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "",
        reference: "",
        content:
            "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "1",
        description: "",
        reference: "",
        content:
            "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "",
        reference: "",
        content:
            "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "20",
        description: "",
        reference: "",
        content:
            "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "",
        reference: "",
        content:
            "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "",
        reference: "",
        content:
            "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "",
        reference: "",
        content:
            "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "3",
        description: "",
        reference: "",
        content:
            "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "100",
        description: "",
        reference: "",
        content:
            "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "100",
        description: "",
        reference: "",
        content: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ."));
    listazker.add(Azker(
        category: "أذكار الصباح",
        count: "100",
        description: "",
        reference: "",
        content: "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "1",
        description: "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ",
        reference: "",
        content:
            "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "1",
        description: "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ",
        reference: "",
        content:
            "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "3",
        description: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم",
        reference: "",
        content:
            "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "3",
        description: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم",
        reference: "",
        content:
            "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "3",
        description: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم",
        reference: "",
        content:
            "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "1",
        description: "",
        reference: "",
        content:
            "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "3",
        description: "",
        reference: "",
        content:
            "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "4",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "7",
        description: "",
        reference: "",
        content:
            "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. "));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "3",
        description: "",
        reference: "",
        content:
            "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "1",
        description: "",
        reference: "",
        content:
            "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ. "));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "3",
        description: "",
        reference: "",
        content:
            "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "3",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "3",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي. "));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "3",
        description: "",
        reference: "",
        content:
            "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "1",
        description: "",
        reference: "",
        content:
            "أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "3",
        description: "",
        reference: "",
        content:
            "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "20",
        description: "",
        reference: "",
        content:
            "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد."));
    listazker.add(Azker(
      category: "أذكار المساء",
      count: "3",
      description: "",
      reference: "",
      content:
          "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
    ));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "3",
        description: "",
        reference: "",
        content:
            "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "3",
        description: "",
        reference: "",
        content:
            "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "3",
        description: "",
        reference: "",
        content:
            "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "100",
        description: "",
        reference: "",
        content:
            "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ."));
    listazker.add(Azker(
        category: "أذكار المساء",
        count: "100",
        description: "",
        reference: "",
        content: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ."));
    listazker.add(Azker(
        category: "أذكار بعد الصلاة",
        count: "3",
        description: "",
        reference: "",
        content: "أَسْـتَغْفِرُ الله"));
    listazker.add(Azker(
        category: "أذكار بعد الصلاة",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام ."));
    listazker.add(Azker(
        category: "أذكار بعد الصلاة",
        count: "1",
        description: "",
        reference: "",
        content:
            "لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون."));
    listazker.add(Azker(
        category: "أذكار بعد الصلاة",
        count: "3",
        description: "",
        reference: "",
        content: "سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر"));
    listazker.add(Azker(
        category: "أذكار بعد الصلاة",
        count: "1",
        description: "",
        reference: "",
        content:
            "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير."));
    listazker.add(Azker(
        category: "أذكار بعد الصلاة",
        count: "3",
        description: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم",
        reference: "",
        content:
            "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ."));
    listazker.add(Azker(
        category: "أذكار بعد الصلاة",
        count: "3",
        description: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم",
        reference: "",
        content:
            "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ."));
    listazker.add(Azker(
        category: "أذكار بعد الصلاة",
        count: "3",
        description: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم",
        reference: "",
        content:
            "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ."));
    listazker.add(Azker(
        category: "أذكار بعد الصلاة",
        count: "1",
        description: "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ",
        reference: "",
        content:
            "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ."));
    listazker.add(Azker(
        category: "أذكار بعد الصلاة",
        count: "10",
        description: "",
        reference: "",
        content:
            "لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير."));
    listazker.add(Azker(
        category: "أذكار بعد الصلاة",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً."));
    listazker.add(Azker(
        category: "أذكار بعد الصلاة",
        count: "7",
        description: "",
        reference: "",
        content: "اللَّهُمَّ أَجِرْنِي مِنْ النَّار."));
    listazker.add(Azker(
        category: "أذكار بعد الصلاة",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ. "));
    listazker.add(Azker(
        category: "أذكار النوم",
        count: "1",
        description: "",
        reference: "",
        content:
            "بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين."));
    listazker.add(Azker(
        category: "أذكار النوم",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة."));
    listazker.add(Azker(
        category: "أذكار النوم",
        count: "3",
        description: "",
        reference: "",
        content: "اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك. "));
    listazker.add(Azker(
        category: "أذكار النوم",
        count: "1",
        description: "",
        reference: "",
        content: "بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا."));
    listazker.add(Azker(
        category: "أذكار النوم",
        count: "1",
        description: "",
        reference: "",
        content:
            "الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي."));
    listazker.add(Azker(
        category: "أذكار النوم",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ عالِـمَ الغَـيبِ وَالشّـهادةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَليـكَه، أَشْهـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي، وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم ."));
    listazker.add(Azker(
        category: "أذكار النوم",
        count: "1",
        description: "",
        reference: "",
        content:
            "اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت."));
    listazker.add(Azker(
        category: "أذكار النوم",
        count: "33",
        description: "",
        reference: "",
        content: "سُبْحَانَ اللَّهِ."));
    listazker.add(Azker(
        category: "أذكار النوم",
        count: "33",
        description: "",
        reference: "",
        content: "الْحَمْدُ لِلَّهِ."));
    listazker.add(Azker(
        category: "أذكار النوم",
        count: "34",
        description: "",
        reference: "",
        content: "اللَّهُ أَكْبَرُ."));
    listazker.add(Azker(
        category: "أذكار النوم",
        count: "3",
        description: "",
        reference: "",
        content:
            "يجمع كفيه ثم ينفث فيهما والقراءة فيهما‏:‏ ‏{‏قل هو الله أحد‏}‏ و‏{‏قل أعوذ برب الفلق‏}‏ و‏{‏قل أعوذ برب الناس‏}‏ ومسح ما استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده."));
    listazker.add(Azker(
        category: "أذكار النوم",
        count: "1",
        description: " أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ",
        reference: "",
        content:
            "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ."));
    listazker.add(Azker(
        category: "أذكار النوم",
        count: "1",
        description: "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ",
        reference: "",
        content:
            "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ."));
    listazker.add(Azker(
        category: "أذكار الإستيقاظ",
        count: "1",
        description: "",
        reference: "",
        content:
            "الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور."));
    listazker.add(Azker(
        category: "أذكار الإستيقاظ",
        count: "1",
        description: "",
        reference: "",
        content:
            "الحمدُ للهِ الذي عافاني في جَسَدي وَرَدّ عَليّ روحي وَأَذِنَ لي بِذِكْرِه."));
    listazker.add(Azker(
        category: "أذكار الإستيقاظ",
        count: "1",
        description: "",
        reference: "",
        content:
            "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، لهُ المُلـكُ ولهُ الحَمـد، وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ، والحمْـدُ لله ، ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة إلاّ باللّهِ العليّ العظيم. رَبِّ اغْفرْ لي."));
    listazker.add(Azker(
        category: "أذكار الصلاة",
        count: "1",
        description: "أدعية استفتاح الصلاة",
        reference: "",
        content:
            "اللَّهُمَّ بَاعِدْ بَيْنِيْ وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللهم نَقِّنِيْ مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأبْيَضُ مِنَ الدَّنَسِ، اللهم اغْسِلْنِيْ مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ والْبَرَدِ. سُبْحَانَكَ سُبْحَانَكَ اللهم وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ. الْحَمْدُ الْحَمْدُ للّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ. اللهُ أكْبَرُ كَبِيْرًا، وَالْحَمْدُ لِلهِ كَثِيْرًا، وَسُبْحَانَ اللهِ بُكْرَةً وَّاصِيْلًا. أعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْخِهِ، وَنَفْثِهِ، وَهَمْزِهِ. اللَّهُمَّ رَبَّ جَبْرَائِيلَ، وَمِيْكَائِيلَ، وَإِسْرَافِيْلَ، فَاطِرَ السَّمَوَاتِ وَالْأرْضِ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْمَا كَانُوا فِيْهِ يَخْتَلِفُونَ، اِهْدِنِيْ لِمَا اخْتُلِفَ فِيْهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِيْ مَنْ تَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيْمٍ. وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمَوَاتِ وَالْأرْضَ حَنِيْفًا وَّمَا أنَا مِنَ الْمُشْرِكِيْنَ، إِنَّ صَلَاتِيْ، وَنُسُكِيْ، وَمَحْيَايَ، وَمَمَاتِيْ لِلهِ رَبِّ الْعَالَمِيْنَ، لَا شَرِيْكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَانَا مِنَ الْمُسْلِمِيْنَ، اللهم أنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أنْتَ، أنْتَ رَبِّيْ وَأنَا عَبْدُكَ، ظَلَمْتُ نَفْسِيْ وَاعْتَرَفْتُ بِذَنْبِيْ فَاغْفِرْ لِيْ ذُنُوْبِيْ جَمِيْعًا إِنَّهُ لَا يَغْفِرُ الذُّنوبَ إِلَّا أنْتَ. وَاهْدِنِيْ لِأحْسَنِ الْأخْلَاقِ لَا يَهْدِيْ لِأحْسَنِهَا إِلَّا أنْتَ، وَاصْرِفْ عَنِّيْ سَيِّئَهَا، لَا يَصْرِفُ عَنِّيْ سَيِّئَهَا إِلَّا أنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أنَا بِكَ وَإِلَيْكَ، تَبارَكْتَ وَتَعَالَيْتَ، أسْتَغْفِرُكَ وَأتُوْبُ إِلَيْكَ."));
    listazker.add(Azker(
        category: "أذكار الصلاة",
        count: "1",
        description: "أدعية الركوع",
        reference: "",
        content:
            "سُبْحانَ رَبِّيَ الْعَظِيْمِ. ثلاث مراتٍ أو أكثر. سُبْحَانَ رَبِّيَ العَظِيمِ وَبِحَمْدِهِ. ثلاث مراتٍ. سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي. سُبُّوُحٌ، قُدُّوسٌ، رَبُّ المَلَائِكَةِ وَالرُّوْحِ. سُبْحَانَ ذِيْ الْجَبَرُوْتِ، وَالْمَلَكُوْتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ. اللَّهمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِي وَبَصَرِي، وَمُخِّي وَعَظْمِي وَعَصَبِي."));
    listazker.add(Azker(
        category: "أذكار الصلاة",
        count: "1",
        description: "أدعية الرفع من الركوع",
        reference: "",
        content:
            "سَمِعَ اللهُ لِمَنْ حَمِدَهُ. رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيْرًا طَيِّبًا مُبارَكًا فِيْهِ. اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ اسْلَمْتُ، خَشَعَ لَكَ سَمْعِيْ، و بَصَـرِيْ، وَمُخِّيْ، وَعَظْمِيْ، وَعَصَبِيْ، وَمَا استَقَلَّتْ بِهِ قَدَمِيْ لِلهِ رَبِّ الْعَالَمِيْنَ. اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاوَاتِ وَمِلْءَ الْارْضِ، وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، أهْلَ الثَّنَاءِ وَالْمَجْدِ، أحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ، اللهم لَا مَانِعَ لِمَا أعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الْجَدُّ. اللَّهُمَّ لَكَ الْحَمْدُ مِلْءَ السَّمَاءِ، وَمِلْءَ الْارْضِ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ، وَالْمَاءِ الْبَارِدِ، اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا، كَمَا يُنَقَّى الثَّوْبُ الْابْيَضُ مِنَ الْوَسَخِ."));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعاء لبس الثوب",
        reference: "",
        content:
            "الحمدُ للهِ الّذي كَساني هذا (الثّوب) وَرَزَقَنيه مِنْ غَـيـْرِ حَولٍ مِنّي وَلا قـوّة. "));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعاء لبس الثوب الجديد",
        reference: "",
        content: "اللهم لك الحمد أنت كسوتنيه، أسألك من خيره"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعاء الكرب",
        reference: "",
        content:
            "لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات، ورب الأرض ورب العرش الكريم اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين وأصلح لي شأني كله ، لا إله إلا أنت لا إله إلا أنت سبحانك إني كنت من الظالمين الله الله رب لا أشرك به شيئا"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعاء الهم والحزن",
        reference: "",
        content:
            "اللهم إني عبدك ابن عبدك ابن أمتك ناصيتي بيدك ماض في حكمك ، عدل في قضاؤك أسألك بكل اسم هو لك سميت به نفسك أو أنزلته في كتابك ، أو علمته أحداً من خلقك أو استأثرت به في علم الغيب عندك أن تجعل القرآن ربيع قلبي ، ونور صدري وجلاء حزني وذهاب همي. اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن ، وضلع الدين وغلبة الرجال."));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعاء قضاء الدين",
        reference: "",
        content: "اللهم اكفنى بحلالك عن حرامك وأغننى بفضلك عمن سواك"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعاء الريح",
        reference: "",
        content:
            "اللهم إنى أسألك خيرها، وخير ما فيها، وخير ما أرسلت به، وأعوذ بك من شرها، وشر ما فيها وشر ما أرسلت به."));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعاء الرعـد",
        reference: "",
        content: "سبحان الله الذي يسبح الرعد بحمده والملائكة من خيفته"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعاء زيارة القبور",
        reference: "",
        content:
            "السلام عليكم أهل الديار من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون ويرحم الله المستقدمين منا والمستأخرين، أسأل الله لنا ولكم العافية."));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعاء نزول االمطر",
        reference: "",
        content: "اللهم صيباَ نافعاَ "));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description:
            "دعاء ركوب الدابة أو ما يقوم مقامها ( السيارة أو القطار أو الطائرة أو السفينة)",
        reference: "",
        content:
            "بسم الله ، الحمد لله ، سبحان الذي سخر لنا هذا وماكنا له مقرنين وإنا إلى ربنا لمنقلبون، الحمد لله ، الحمد لله ، الحمد لله ، الله اكبر ، الله أكبر ، الله أكبر ، سبحانك اللهم إني ظلمت نفسي فاغفر لي ، فإنه لايغفر الذنوب إلا أنت"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعاء السفر",
        reference: "",
        content:
            "اللهم إنا نسألك في سفرنا هذا البر والتقوى، ومن العمل ماترضى ، اللهم هون علينا سفرنا هـذا واطوِ عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر وسوء المنقلب في المال والأهل."));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعاء المسافر للمقيم",
        reference: "",
        content: "استودعكم الله الذي لا تضيع ودائعه"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعاء المقيم للمسافر",
        reference: "",
        content:
            "أستودع ُ الله دينك وأمانتك ، وخواتيم عملك زودك الله التقوى، وغفر ذنبك، ويسر لك الخير حيث ما كنت"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعـــاء النـــزول في مكــان",
        reference: "",
        content: "أعوذ بكلمات الله التامات من شر ما خلق"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "الدعاء بين السجدتين",
        reference: "",
        content:
            "رب اغفر لي رب اغفر لي اللهم اغفر لي ، وارحمني واهدني واجبرني وعافني وارزقني وارفعني"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعـاء من استصعب عليه أمر",
        reference: "",
        content: "اللهم لاسهل إلا ماجعلته سهلا وأنت تجعل الحزن إذا شئت سهل"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعـاء الخوف من الشــرك",
        reference: "",
        content:
            "اللهم إني أ عوذ بك أن أشرك بك وأنا أعلم ، وأستغفرك لما لا أعلم "));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "100",
        description: "ما يقال في المجلس",
        reference: "",
        content:
            "رب اغفر لي وتب عليّ إنك أنت التواب الغفور (100 مرة قبل أن يقوم) "));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "كفارة المجلس",
        reference: "",
        content:
            "سبحانك اللهم وبحمدك ، أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعـاء الغـضـب",
        reference: "",
        content: "أعوذ بالله من الشيطان الرجيـم"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "الدعاء للمتزوج",
        reference: "",
        content: "بارك الله لك ، وبارك عليك ، وجمع بينكما في خير"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعاء المتزوج لنفسه",
        reference: "",
        content:
            "اللهم إني أسألك خيرها وخير ماجبلتها عليه وأعوذ بك من شرها وشر ماجبلتها عليه ، وإذا اشترى بعيراً فليأخذ بذروة سنامه وليقل مثل ذلك"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "الدعاء قبل الجماع",
        reference: "",
        content: "بسم الله ـ اللهم جنبنا الشيطان، وجنب الشيطان مارزقتنا "));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "الدعاء عند افطار الصائم",
        reference: "",
        content: "ذهب الضمـأ ، وأبتلت العروق ، وثبت الأجر إن شاء الله"));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعـاء صـلاة الاستخـارة",
        reference: "",
        content:
            "قال جابر بن عبدالله رضي الله عنهما : كان رسول الله صلى الله عليه وسلم يعلمنا الاستخارة في الامور كلها كما يعلمنا السورة من القرآن ، يقول : ( إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة ثم ليقل : اللهم إني أستخيرك بعلمك ، وأستقدرك بقدرتك وأسألك من فضلك العظيم فإنك تقدر ولا أقدر وتعلم ولاأعلم وأنت علام الغيوب ، اللهم إن كنت تعلم أن هذا الأمر ـ ويسمي حاجته ـ خيرا لي في ديني ومعاشي وعاقبة أمري ـ أو قال عاجله وآجله ـ فأقدره لي ويسره لي ثم بارك لي فيه ، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري ـ أو قال عاجله وآجله ـ فاصرفه عني واصرفني عنه واقدر لي الخير حيث كان ثم ارضني به)."));
    listazker.add(Azker(
        category: "أذكار متفرقة",
        count: "1",
        description: "دعـاء سجود التلاوة",
        reference: "",
        content:
            "سجد وجهي للذي خلقه ،وشق سمعه وبصره بحوله وقوته ( فتبارك الله احسن الخالقين )"));
    listazker.add(Azker(
        category: "أذكار الآذان",
        count: "1",
        description: "ما يقال عند سماع الأذان",
        reference: "",
        content:
            "يَقُولُ مِثْلَ مَا يَقُولُ الـمُؤَذِّنُ إلاَّ فِي حَيَّ عَلَى الصَّلاةِ وَحَيَّ عَلَى الفَلاَحِ فَيَقُولُ : لاَ حَوْلَ وَلا قُوَّةَ إلاَّ باللَّهِ."));
    listazker.add(Azker(
        category: "أذكار الآذان",
        count: "1",
        description: "",
        reference: "",
        content:
            "عنْ سَعْدِ بْن أَبي وقَّاصٍ رضِيَ اللَّه عنْهُ عَن النبي صَلّى اللهُ عَلَيْهِ وسَلَّم أَنَّهُ قَالَ:  مَنْ قَال حِينَ يسْمعُ المُؤذِّنَ : أَشْهَد أَنْ لا إِله إِلاَّ اللَّه وحْدهُ لا شَريك لهُ ، وَأَنَّ مُحمَّداً عبْدُهُ وَرسُولُهُ ، رضِيتُ بِاللَّهِ ربًّا ، وبمُحَمَّدٍ رَسُولاً ، وبالإِسْلامِ دِينًا ، غُفِر لَهُ ذَنْبُهُ . رواه مسلم ."));
    listazker.add(Azker(
        category: "أذكار الآذان",
        count: "1",
        description: "",
        reference: "",
        content:
            "عَنْ عبْدِ اللَّهِ بْنِ عَمرِو بْنِ العاصِ رضِيَ اللَّه عنْهُما أَنه سَمِع رسُولَ اللَّهِ صَلّى اللهُ عَلَيْهِ وسَلَّم يقُولُ : إِذا سمِعْتُمُ النِّداءَ فَقُولُوا مِثْلَ ما يَقُولُ ، ثُمَّ صَلُّوا علَيَّ ، فَإِنَّهُ مَنْ صَلَّى علَيَّ صَلاةً صَلَّى اللَّه عَلَيْهِ بِهَا عشْراً ، ثُمَّ سلُوا اللَّه لي الْوسِيلَةَ ، فَإِنَّهَا مَنزِلَةٌ في الجنَّةِ لا تَنْبَغِي إِلاَّ لعَبْدٍ منْ عِباد اللَّه وَأَرْجُو أَنْ أَكُونَ أَنَا هُو ، فَمنْ سَأَل ليَ الْوسِيلَة حَلَّتْ لَهُ الشَّفاعَةُ . رواه مسلم ."));
    listazker.add(Azker(
        category: "أذكار الآذان",
        count: "1",
        description: "",
        reference: "",
        content:
            "عَنْ جابرٍ بن عبد الله رضَي اللَّه عنهما‏ أَنَّ رَسُولَ اللَّهِ صَلّى اللهُ عَلَيْهِ وسَلَّم قَالَ : من قَال حِين يسْمعُ النِّداءَ : اللَّهُمَّ رَبَّ هذِهِ الدَّعوةِ التَّامَّةِ ، والصَّلاةِ الْقَائِمةِ، آت مُحَمَّداً الْوسِيلَةَ ، والْفَضَيِلَة، وابْعثْهُ مقَامًا محْمُوداً الَّذي وعَدْتَه ، حلَّتْ لَهُ شَفَاعتي يوْم الْقِيامِة .رواه البخاري ."));
    listazker.add(Azker(
        category: "أذكار الآذان",
        count: "1",
        description: "ما يقال بعد سماع الأذان",
        reference: "",
        content:
            "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ. اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، والصَّلاةِ القَائِمَةِ، آتِ مُـحَمَّداً الوَسِيْلَةَ والفَضِيْلَةَ، وابْعَثْهُ مَقَاماً مَـحْمُوداً الَّذِي وَعَدْتَهُ، إنَّكَ لا تُخْلِفُ الـمِيْعَادِ."));
    listazker.add(Azker(
        category: "أذكار الآذان",
        count: "1",
        description: "ما يقال بين الأذان والإقامة",
        reference: "",
        content:
            "ما بين الأذان والإقامة فالدعاء عندئذٍ مرغّب فيه ومستحب.قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:  الدُّعَاءُ لَا يُرَدُّ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ . قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :  إِنَّ الدُّعَاءَ لَا يُرَدُّ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ فَادْعُوا ."));
    listazker.add(Azker(
        category: "أذكار المسجد",
        count: "1",
        description: "دُعَاءُ الذَّهَابِ إلَى المَسْجِدِ",
        reference: "",
        content:
            "اللّهُـمَّ اجْعَـلْ في قَلْبـي نورا ، وَفي لِسـاني نورا، وَاجْعَـلْ في سَمْعي نورا، وَاجْعَـلْ في بَصَري نورا، وَاجْعَـلْ مِنْ خَلْفي نورا، وَمِنْ أَمامـي نورا، وَاجْعَـلْ مِنْ فَوْقـي نورا ، وَمِن تَحْتـي نورا .اللّهُـمَّ أَعْطِنـي نورا."));
    listazker.add(Azker(
        category: "أذكار المسجد",
        count: "1",
        description: "دُعَاءُ دُخُولِ المَسْجِدِ",
        reference: "",
        content:
            "يَبْدَأُ بِرِجْلِهِ اليُمْنَى، وَيَقُولُ:أَعوذُ باللهِ العَظيـم وَبِوَجْهِـهِ الكَرِيـم وَسُلْطـانِه القَديـم مِنَ الشّيْـطانِ الرَّجـيم، بِسْمِ اللَّهِ، وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ الله، اللّهُـمَّ افْتَـحْ لي أَبْوابَ رَحْمَتـِك."));
    listazker.add(Azker(
        category: "أذكار المسجد",
        count: "1",
        description: "دُعَاءُ الخُرُوجِ مِنَ المَسْجِدِ",
        reference: "",
        content:
            "يَبْدَأُ بِرِجْلِهِ الْيُسْرَى، وَيَقُولُ: بِسْـمِ اللَّـهِ وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيم."));
    listazker.add(Azker(
        category: "أذكار الوضوء",
        count: "1",
        description: "الذكر قبل الوضوء",
        reference: "",
        content: "قبل الوضوء:  بِسْمِ ٱللّٰهِ ."));
    listazker.add(Azker(
        category: "أذكار الوضوء",
        count: "1",
        description: "الذكر بعد الوضوء",
        reference: "",
        content:
            "أشْهَدُ أن لا إله إلا الله وحْدَهُ لا شريكَ لهُ ، وأشْهَدُ أنَّ محمداً عَبدُهُ ورسُولُه . اللَّهُمَّ اجْعَلْني مِنَ التَّوَّابينَ واجْعَلْنِي من المُتَطَهِّرِينَ . سُبْحَانَكَ اللَّهُمَّ وبَحَمْدكَ أشْهدُ أنْ لا إلهَ إلا أنْتَ أَسْتَغْفِرُكَ وأتُوبُ إِلَيْكَ ."));
    listazker.add(Azker(
        category: "أذكار المنزل",
        count: "1",
        description: "أذكار الدخول إلى المنزل",
        reference: "",
        content:
            "بِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا."));
    listazker.add(Azker(
        category: "أذكار المنزل",
        count: "1",
        description: "أذكار الخروج من المنزل",
        reference: "",
        content:
            "بِسْمِ اللهِ ، تَوَكَّلْـتُ عَلى اللهِ وَلا حَوْلَ وَلا قُـوَّةَ إِلاّ بِالله. اللّهُـمَّ إِنِّـي أَعـوذُ بِكَ أَنْ أَضِـلَّ أَوْ أُضَـل ، أَوْ أَزِلَّ أَوْ أُزَل ، أَوْ أَظْلِـمَ أَوْ أَُظْلَـم ، أَوْ أَجْهَلَ أَوْ يُـجْهَلَ عَلَـيّ."));
    listazker.add(Azker(
        category: "أذكار الخلاء",
        count: "1",
        description: "الذكر عند الخلاء",
        reference: "",
        content:
            "(بِسْمِ الله) اللّهُـمَّ إِنِّـي أَعـوذُ بِـكَ مِـنَ الْخُـبْثِ وَالْخَبائِث."));
    listazker.add(Azker(
        category: "أذكار الخلاء",
        count: "1",
        description: "الذكر بعد الخروج من الخلاء",
        reference: "",
        content: "غُفْـرانَك."));
    listazker.add(Azker(
        category: "أذكار الطعام",
        count: "1",
        description: "الذكر عند الطعام والشراب",
        reference: "",
        content:
            "بِسْمِ اللهِ. فإنْ نسي في أَوَّلِهِ، فَليَقُلْ: بِسْمِ اللَّه أَوَّلَهُ وَآخِرَهُ."));
    listazker.add(Azker(
        category: "أذكار الطعام",
        count: "1",
        description: "الذكر عند شرب اللبن",
        reference: "",
        content: "اَللَّهُمَّ بَارِكْ لَنَا فِيهِ, وَزِدْنَا مِنْهُ."));
    listazker.add(Azker(
        category: "أذكار الطعام",
        count: "1",
        description: "الذكر عند الفراغ من الطعام والشراب",
        reference: "",
        content:
            "الْحَمْدُ للهِ الَّذِي أَطْعَمَنِي هَذَا, وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِّنِّي وَلاَ قُوَّةٍ. الْحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مَكْفِيٍّ وَلَا مُوَدَّعٍ وَلَا مُسْتَغْنًى عَنْهُ رَبَّنَا."));
    listazker.add(Azker(
        category: "أذكار الطعام",
        count: "1",
        description: "أذكار الضيف",
        reference: "",
        content:
            "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ ، وَأَكَلَ طَعَامَكُمُ الأَبْرَارُ ، وَصَلَّتْ عَلَيْكُمُ الْمَلائِكَةُ."));
    listazker.add(Azker(
        category: "أذكار الطعام",
        count: "1",
        description: "هدى النبى فى الشرب",
        reference: "",
        content:
            "كَانَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ فِي ثَلاَثَةِ أَنْفَاسٍ، إِذَا أَدْنَى الإِنَاءَ إِلَى فَمِهِ سَمَّى اللهَ تَعَالَى, وَإِذَا أَخَّرَهُ حَمِدَ اللهَ تَعَالَى، يَفْعَلُ ذَلِكَ ثَلاَثَ مَرَّاتٍ."));

    //

    listazker.add(Azker(
        category: "", count: "", description: "", reference: "", content: ""));

    return listazker;
  }

  static Future<List<Azker>> getMorningAzkar() async {
    List<Azker> morningAzkar = await getAlldata();
    return morningAzkar
        .where((azkar) => azkar.category == 'أذكار الصباح')
        .toList();
  }

  static Future<List<Azker>> getSalaaZekr() async {
    List<Azker> morningAzkar = await getAlldata();
    return morningAzkar
        .where((azkar) => azkar.category == "أذكار بعد الصلاة")
        .toList();
  }

  static Future<List<Azker>> getNoomZekr() async {
    List<Azker> morningAzkar = await getAlldata();
    return morningAzkar
        .where((azkar) => azkar.category == "أذكار النوم")
        .toList();
  }

  static Future<List<Azker>> getEstykazeZekr() async {
    List<Azker> morningAzkar = await getAlldata();
    return morningAzkar
        .where((azkar) => azkar.category == "أذكار الإستيقاظ")
        .toList();
  }

  static Future<List<Azker>> getMotafarekZekr() async {
    List<Azker> morningAzkar = await getAlldata();
    return morningAzkar
        .where((azkar) => azkar.category == "أذكار متفرقة")
        .toList();
  }

  static Future<List<Azker>> getAzenZekr() async {
    List<Azker> morningAzkar = await getAlldata();
    return morningAzkar
        .where((azkar) => azkar.category == "أذكار الآذان")
        .toList();
  }

  static Future<List<Azker>> getMasgedzekr() async {
    List<Azker> morningAzkar = await getAlldata();
    return morningAzkar
        .where((azkar) => azkar.category == "أذكار المسجد")
        .toList();
  }

  static Future<List<Azker>> getWedoaaZekr() async {
    List<Azker> morningAzkar = await getAlldata();
    return morningAzkar
        .where((azkar) => azkar.category == "أذكار الوضوء")
        .toList();
  }

  static Future<List<Azker>> getManzeleZekr() async {
    List<Azker> morningAzkar = await getAlldata();
    return morningAzkar
        .where((azkar) => azkar.category == "أذكار المنزل")
        .toList();
  }

  static Future<List<Azker>> getKalaaZekr() async {
    List<Azker> morningAzkar = await getAlldata();
    return morningAzkar
        .where((azkar) => azkar.category == "أذكار الخلاء")
        .toList();
  }

  static Future<List<Azker>> getTaameZekr() async {
    List<Azker> morningAzkar = await getAlldata();
    return morningAzkar
        .where((azkar) => azkar.category == "أذكار الطعام")
        .toList();
  }

  static Future<List<Azker>> getEveningAzkar() async {
    List<Azker> morningAzkar = await getAlldata();
    return morningAzkar
        .where((azkar) => azkar.category == 'أذكار المساء')
        .toList();
  }
}
